# Pandas

In [2]:
import pandas as pd
import numpy as np

## Pandas Dataframe and Indexing

In [3]:
sports1=pd.Series([1,2,3,4],index=['cricket','football','basketball','golf'])
sports1

cricket       1
football      2
basketball    3
golf          4
dtype: int64

In [5]:
sports1['football']

2

In [6]:
sports2=pd.Series([11,2,3,4],index=['cricket','football','baseball','golf'])
sports2

cricket     11
football     2
baseball     3
golf         4
dtype: int64

In [9]:
sports1+sports2

baseball       NaN
basketball     NaN
cricket       12.0
football       4.0
golf           8.0
dtype: float64

In [13]:
df1=pd.DataFrame(np.random.rand(8,5),index='A B C D E F G H'.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

     Score1    Score2    Score3    Score4    Score5
A  0.973413  0.232670  0.796476  0.901416  0.960511
B  0.484859  0.233468  0.154419  0.133543  0.293021
C  0.015519  0.615446  0.229605  0.460556  0.008486
D  0.975716  0.803414  0.692765  0.049644  0.812040
E  0.362397  0.822423  0.320387  0.180053  0.626716
F  0.586806  0.294748  0.113851  0.250750  0.630310
G  0.125843  0.737709  0.996930  0.848911  0.391484
H  0.263156  0.998083  0.178112  0.731967  0.677949

In [14]:
df1["Score1"]

A    0.973413
B    0.484859
C    0.015519
D    0.975716
E    0.362397
F    0.586806
G    0.125843
H    0.263156
Name: Score1, dtype: float64

In [15]:
df1[["Score1","Score2"]]

     Score1    Score2
A  0.973413  0.232670
B  0.484859  0.233468
C  0.015519  0.615446
D  0.975716  0.803414
E  0.362397  0.822423
F  0.586806  0.294748
G  0.125843  0.737709
H  0.263156  0.998083

In [16]:
df1['Score6']=df1['Score1']+df1['Score2']
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.973413  0.232670  0.796476  0.901416  0.960511  1.206083
B  0.484859  0.233468  0.154419  0.133543  0.293021  0.718328
C  0.015519  0.615446  0.229605  0.460556  0.008486  0.630964
D  0.975716  0.803414  0.692765  0.049644  0.812040  1.779130
E  0.362397  0.822423  0.320387  0.180053  0.626716  1.184820
F  0.586806  0.294748  0.113851  0.250750  0.630310  0.881554
G  0.125843  0.737709  0.996930  0.848911  0.391484  0.863552
H  0.263156  0.998083  0.178112  0.731967  0.677949  1.261238

In [17]:
df2={'ID':['01','02','03','04','05'],'Name':['Mukund','Tejash','Krish','Jitu','Riya'],'Profit':[23,34,54,64,73]}
df=pd.DataFrame(df2)
df

   ID    Name  Profit
0  01  Mukund      23
1  02  Tejash      34
2  03   Krish      54
3  04    Jitu      64
4  05    Riya      73

In [18]:
df["ID"]

0    01
1    02
2    03
3    04
4    05
Name: ID, dtype: object

In [19]:
df["Name"]

0    Mukund
1    Tejash
2     Krish
3      Jitu
4      Riya
Name: Name, dtype: object

In [20]:
df["Profit"]

0    23
1    34
2    54
3    64
4    73
Name: Profit, dtype: int64

In [22]:
df[["Name","Profit"]]

     Name  Profit
0  Mukund      23
1  Tejash      34
2   Krish      54
3    Jitu      64
4    Riya      73

In [23]:
df=df.drop("ID",axis=1)

In [24]:
df

     Name  Profit
0  Mukund      23
1  Tejash      34
2   Krish      54
3    Jitu      64
4    Riya      73

In [25]:
df.drop(3)

     Name  Profit
0  Mukund      23
1  Tejash      34
2   Krish      54
4    Riya      73